Question 1

Question: How do you select rows from a DataFrame where any value in the row exceeds a threshold?

import pandas as pd

df = pd.DataFrame({'A': [1, 2, 3, 4, 5], 'B': [10, 20, 30, 40, 50]})
threshold = 30

Answer:

In [1]:
import pandas as pd

In [2]:
df = pd.DataFrame({'A': [1, 2, 3, 4, 5], 'B': [10, 20, 30, 40, 50]})
threshold = 30

In [3]:
df

   A   B
0  1  10
1  2  20
2  3  30
3  4  40
4  5  50

In [7]:
selected_rows = df[df.max(axis=1) > threshold]

In [5]:
selected_rows

   A   B
3  4  40
4  5  50

Question: How do you sort a DataFrame by columns A and B?

import pandas as pd

df = pd.DataFrame({'A': [2, 1, 2], 'B': [2, 3, 1], 'C': [1, 2, 3]})

Answer:

In [15]:
df = pd.DataFrame({'A': [2, 1, 2], 'B': [2, 3, 1], 'C': [1, 2, 3]})

#df = pd.DataFrame({'A': [1, 1,1], 'B' : [2,2,2], 'C': [3,3,3]})
df

   A  B  C
0  2  2  1
1  1  3  2
2  2  1  3

In [18]:
sorted_df = df.sort_values(['A', 'B'], ascending=[True, False])
sorted_df

   A  B  C
1  1  3  2
0  2  2  1
2  2  1  3

Question 3
Question: How do you concatenate two DataFrames vertically?

df1 = pd.DataFrame({'A': [1, 2, 3], 'B': [4, 5, 6]})
df2 = pd.DataFrame({'A': [7, 8, 9], 'B': [10, 11, 12]})

Answer

In [19]:
df1 = pd.DataFrame({'A': [1, 2, 3], 'B': [4, 5, 6]})
df2 = pd.DataFrame({'A': [7, 8, 9], 'B': [10, 11, 12]})

In [20]:
df1

   A  B
0  1  4
1  2  5
2  3  6

In [21]:
df2

   A   B
0  7  10
1  8  11
2  9  12

In [24]:
combined_df = pd.concat([df1, df2], ignore_index=True)
combined_df

   A   B
0  1   4
1  2   5
2  3   6
3  7  10
4  8  11
5  9  12

Question 4

Question: How do you compute the cumulative sum of a column in a DataFrame?

import pandas as pd

df = pd.DataFrame({'A': [1, 2, 3, 4, 5]})

Answer

In [26]:
df = pd.DataFrame({'A': [1, 2, 3, 4, 5]})
df

   A
0  1
1  2
2  3
3  4
4  5

In [27]:
df['cumsum'] = df['A'].cumsum()
df

   A  cumsum
0  1       1
1  2       3
2  3       6
3  4      10
4  5      15

Question 5

Question: How do you convert a Series of strings to uppercase?

import pandas as pd

series = pd.Series(['apple', 'banana', 'cherry'])

Answer:

In [28]:
series = pd.Series(['apple', 'banana', 'cherry'])
series

0     apple
1    banana
2    cherry
dtype: object

In [29]:
uppercase_series = series.str.upper()
uppercase_series

0     APPLE
1    BANANA
2    CHERRY
dtype: object